posts/2016-09-06-benediction-for-22-shenanigans.org
#+date: <2016-09-06>
#+filetags: prayer religion
#+title: Benediction for 22 Shenanigans

22 Shenanigans is an organization dedicated to reducing the number of suicides among veterans. Here is the benediction from the sermon I preached at an event they held on Labor Day weekend.


Go now, follow where Christ calls you\\
and proclaim the message God gives you. \\
Don't be distracted by the concerns of the world,\\
but stay focused on the hope that is within you.

May the Father be your strength and confidence;\\
May Christ Jesus give you courage for his mission;\\
And may the Spirit speak when your words fail.

/Amen/


#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]] [[file:../tags/religion.org][Religion]]
#+end_tagline
