docs/posts/2016-09-06-benediction-for-22-shenanigans.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Benediction for 22 Shenanigans</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Benediction for 22 Shenanigans</h1>
<p class="subtitle" role="doc-subtitle">Sep 06, 2016</p>
</header><p>
22 Shenanigans is an organization dedicated to reducing the number of suicides among veterans. Here is the benediction from the sermon I preached at an event they held on Labor Day weekend.
</p>


<p>
Go now, follow where Christ calls you<br>
and proclaim the message God gives you. <br>
Don&rsquo;t be distracted by the concerns of the world,<br>
but stay focused on the hope that is within you.
</p>

<p>
May the Father be your strength and confidence;<br>
May Christ Jesus give you courage for his mission;<br>
And may the Spirit speak when your words fail.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="orgc33bb37">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
